# Pandas

Pandas is a popular open-source data manipulation and analysis library for Python. 

It provides easy-to-use data structures and functions designed to make working with structured data seamless. 

The primary data structures in Pandas are the DataFrame and Series.

### What is dataframe?

A dataframe is a two-dimensional, tabular data structure with labeled axes (rows and columns). 

It is similar to a spreadsheet or SQL table, allowing for easy handling and manipulation of structured data.

### What is dataseries?

A series is a one-dimensional labeled array, similar to a column in a DataFrame. 

It can hold any data type and is useful for tasks like time series analysis.

In [1]:
# First step is to import pandas
import pandas as pd
import numpy as np

In [2]:
data = {'Name': ['Soumya', 'Saunak', 'Kaustav'], 
        'Age': [21, 30, 22],
        'City': ['Kolkata', 'Bangalore', 'Tamil Nadu']}

In [3]:
df = pd.DataFrame(data)

In [4]:
print(df)

      Name  Age        City
0   Soumya   21     Kolkata
1   Saunak   30   Bangalore
2  Kaustav   22  Tamil Nadu

In [5]:
df.head() # prints first five rows

      Name  Age        City
0   Soumya   21     Kolkata
1   Saunak   30   Bangalore
2  Kaustav   22  Tamil Nadu

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.loc[0]

Name     Soumya
Age          21
City    Kolkata
Name: 0, dtype: object

In [8]:
type(df.loc[0])

pandas.core.series.Series

In [9]:
df.iloc[:,:]

      Name  Age        City
0   Soumya   21     Kolkata
1   Saunak   30   Bangalore
2  Kaustav   22  Tamil Nadu

In [10]:
df.iloc[:,:1]

      Name
0   Soumya
1   Saunak
2  Kaustav

In [11]:
df=pd.read_csv("Automobile_data.csv")

In [12]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   index             61 non-null     int64
 1   company           61 non-null     object
 2   body-style        61 non-null     object
 3   wheel-base        61 non-null     float64
 4   length            61 non-null     float64
 5   engine-type       61 non-null     object
 6   num-of-cylinders  61 non-null     object
 7   horsepower        61 non-null     int64
 8   average-mileage   61 non-null     int64
 9   price             58 non-null     float64
dtypes: float64(3), int64(3), object(4)
memory usage: 4.9+ KB

In [14]:
df.describe()

,index,wheel-base,length,horsepower,average-mileage,price
count,61.000000,61.000000,61.000000,61.000000,61.000000,58.000000
mean,40.885246,98.481967,173.098361,107.852459,25.803279,15387.000000
std,25.429706,6.679234,14.021846,53.524398,8.129821,11320.259841
min,0.000000,88.400000,141.100000,48.000000,13.000000,5151.000000
25%,18.000000,94.500000,159.100000,68.000000,19.000000,6808.500000
50%,39.000000,96.300000,171.200000,100.000000,25.000000,11095.000000
75%,61.000000,101.200000,177.300000,123.000000,31.000000,18120.500000
max,88.000000,120.900000,208.100000,288.000000,47.000000,45400.000000

In [15]:
df['num-of-cylinders'].value_counts()

four      39
six       11
five       5
eight      3
three      1
twelve     1
two        1
Name: num-of-cylinders, dtype: int64

In [16]:
df[df['horsepower']>110]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
9,11,bmw,sedan,101.2,176.8,ohc,six,121,21,20970.0
10,13,bmw,sedan,103.5,189.0,ohc,six,182,16,30760.0
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
24,33,jaguar,sedan,113.0,199.6,dohc,six,176,15,32250.0
25,34,jaguar,sedan,113.0,199.6,dohc,six,176,15,35550.0
26,35,jaguar,sedan,102.0,191.7,ohcv,twelve,262,13,36000.0
32,44,mercedes-benz,sedan,110.0,190.9,ohc,five,123,22,25552.0
33,45,mercedes-benz,wagon,110.0,190.9,ohc,five,123,22,28248.0
34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
44,57,nissan,sedan,100.4,184.6,ohcv,six,152,19,13499.0
45,61,porsche,hardtop,89.5,168.9,ohcf,six,207,17,34028.0
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [17]:
df.corr()

,index,wheel-base,length,horsepower,average-mileage,price
index,1.000000,0.013401,0.004828,-0.093809,0.176037,-0.197470
wheel-base,0.013401,1.000000,0.878381,0.463421,-0.547325,0.663085
length,0.004828,0.878381,1.000000,0.668555,-0.788429,0.788465
horsepower,-0.093809,0.463421,0.668555,1.000000,-0.808804,0.901707
average-mileage,0.176037,-0.547325,-0.788429,-0.808804,1.000000,-0.770217
price,-0.197470,0.663085,0.788465,0.901707,-0.770217,1.000000

### Handling missing values

In [18]:
lst_data=[[1,2,3],[3,4,np.nan],[5,6,np.nan],[np.nan,np.nan,np.nan]]

In [19]:
df=pd.DataFrame(lst_data)

In [20]:
df

     0    1    2
0  1.0  2.0  3.0
1  3.0  4.0  NaN
2  5.0  6.0  NaN
3  NaN  NaN  NaN

In [21]:
df.dropna(axis=0)

     0    1    2
0  1.0  2.0  3.0

In [22]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'c', 'e', 'f', 'h'],
                  columns=['col_1', 'col_2', 'col_3'])

In [24]:
df

      col_1     col_2     col_3
a -0.796909 -0.757544 -0.812078
c -1.311093 -0.394075  0.501785
e  0.354328 -0.794884 -0.182533
f -2.052591 -0.385379  0.474432
h -0.246433  1.605646  0.581159

In [25]:
df2=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [26]:
df2

      col_1     col_2     col_3
a -0.796909 -0.757544 -0.812078
b       NaN       NaN       NaN
c -1.311093 -0.394075  0.501785
d       NaN       NaN       NaN
e  0.354328 -0.794884 -0.182533
f -2.052591 -0.385379  0.474432
g       NaN       NaN       NaN
h -0.246433  1.605646  0.581159

In [27]:
df2.dropna(axis=0)

      col_1     col_2     col_3
a -0.796909 -0.757544 -0.812078
c -1.311093 -0.394075  0.501785
e  0.354328 -0.794884 -0.182533
f -2.052591 -0.385379  0.474432
h -0.246433  1.605646  0.581159

In [28]:
pd.isna(df2['col_1'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: col_1, dtype: bool

In [29]:
df2['col_1'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: col_1, dtype: bool

In [30]:
df2.fillna('0.0')

      col_1     col_2     col_3
a -0.796909 -0.757544 -0.812078
b       0.0       0.0       0.0
c -1.311093 -0.394075  0.501785
d       0.0       0.0       0.0
e  0.354328 -0.794884 -0.182533
f -2.052591 -0.385379  0.474432
g       0.0       0.0       0.0
h -0.246433  1.605646  0.581159

In [31]:
df2['col_1'].values

array([-0.79690943,         nan, -1.31109276,         nan,  0.35432785,
       -2.05259098,         nan, -0.24643263])

### CSV

In [32]:
from io import StringIO, BytesIO

In [40]:
data = ('col_1,col_2,col_3\n'
            'x,y,1\n'
            'a,b,2\n'
            'i,ii,3')

In [41]:
type(data)

str

In [42]:
pd.read_csv(StringIO(data))

  col_1 col_2  col_3
0     x     y      1
1     a     b      2
2     i    ii      3

In [43]:
## Read from specific columns
df=pd.read_csv(StringIO(data), usecols=lambda x: x.upper() in ['COL1', 'COL3'])

In [44]:
df.to_csv('Test.csv')

In [61]:
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11')

In [62]:
df=pd.read_csv(StringIO(data),dtype=object)

In [63]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [64]:
df['c'][1]

'7'

In [65]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':np.float64,'a':'Int64'})

In [66]:
df

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [67]:
df['c'][1]

7.0

In [68]:
df.dtypes

a      Int64
b      int32
c    float64
d    float64
dtype: object

In [73]:
# Index column and training delimiters
data = ('index,a,b,c\n'
           '4,apple,red,5.7\n'
            '8,banana,yellow,10')

In [74]:
pd.read_csv(StringIO(data),index_col=0)

            a       b     c
index
4       apple     red   5.7
8      banana  yellow  10.0

In [75]:
data = ('index,a,b,c\n'
           '4,apple,red,\n'
            '8,banana,yellow,')

In [76]:
pd.read_csv(StringIO(data))

   index       a       b   c
0      4   apple     red NaN
1      8  banana  yellow NaN